In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [20,50,70]
n1 = np.array(my_data)
d = {'a':20,'b':50,'c':70}

In [4]:
labels

['a', 'b', 'c']

In [5]:
my_data

[20, 50, 70]

In [6]:
d

{'a': 20, 'b': 50, 'c': 70}

In [7]:
pd.Series(data = my_data)

0    20
1    50
2    70
dtype: int64

In [8]:
pd.Series(data=my_data,index=labels)

a    20
b    50
c    70
dtype: int64

In [9]:
pd.Series(my_data,labels)

a    20
b    50
c    70
dtype: int64

In [10]:
dex = ['s','m','d']
data_dex = [100,50,25]
pertamina = np.array(data_dex)
d = {'s':100,'m':50,'d':25}
pd.Series(data_dex,dex)

s    100
m     50
d     25
dtype: int64

In [11]:
pd.Series(d)

s    100
m     50
d     25
dtype: int64

In [12]:
d

{'s': 100, 'm': 50, 'd': 25}

In [13]:
pd.Series(data_dex)

0    100
1     50
2     25
dtype: int64

In [14]:
pd.Series(data_dex,dex)

s    100
m     50
d     25
dtype: int64

In [15]:
pd.Series(data = dex)

0    s
1    m
2    d
dtype: object

In [16]:
pd.Series(data = [sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [17]:
ser1 = pd.Series([1,2,3,4],['indonesia','malaysia','thailand','vietman'])

In [18]:
ser1

indonesia    1
malaysia     2
thailand     3
vietman      4
dtype: int64

In [19]:
ser2 = pd.Series([1,3,4,5],['indonesia','china','vietnam','russia'])

In [20]:
ser2

indonesia    1
china        3
vietnam      4
russia       5
dtype: int64

In [21]:
ser3 =pd.Series(data=labels)

In [22]:
ser3

0    a
1    b
2    c
dtype: object

In [23]:
ser2['china']

3

In [24]:
from numpy.random import randn

In [25]:
np.random.seed(101)

In [26]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['X','W','Y','Z'])

In [27]:
df

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df['W']

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: W, dtype: float64

In [29]:
df[['W','X']]

          W         X
A  0.628133  2.706850
B -0.319318  0.651118
C  0.740122 -2.018168
D -0.758872  0.188695
E  1.978757  0.190794

In [30]:
type(df['W'])

pandas.core.series.Series

In [31]:
df['Baru']=df['W']+df['Y']

In [32]:
df

          X         W         Y         Z      Baru
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [33]:
df.drop('Baru',axis=1,inplace=True)

In [34]:
df

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
df.drop('E',axis=0)

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
#row

In [37]:
df

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [38]:
df.loc['E']

X    0.190794
W    1.978757
Y    2.605967
Z    0.683509
Name: E, dtype: float64

In [39]:
df.iloc[3]

X    0.188695
W   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [40]:
df.iloc[[2,3],[1,2]]

          W         Y
C  0.740122  0.528813
D -0.758872 -0.933237

In [41]:
df.loc[['D','E'],['X','Z']]

          X         Z
D  0.188695  0.955057
E  0.190794  0.683509

In [96]:
df

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
df > 0

       X      W      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [98]:
booldf = df>0

In [99]:
booldf

       X      W      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [100]:
df[booldf]

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [101]:
df[df>0]

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [102]:
df[df['Z']>0]

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [103]:
df['W']>0

A     True
B    False
C     True
D    False
E     True
Name: W, dtype: bool

In [108]:
df[df['W']>0]

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [109]:
df

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [110]:
df[df['Z']>0]

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [115]:
df[df['W']>0]

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [116]:
resultdf

          X         W         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [117]:
resultdf['X']

A    2.706850
C   -2.018168
E    0.190794
Name: X, dtype: float64

In [121]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.907969  2.706850
C  0.528813 -2.018168
E  2.605967  0.190794

In [130]:
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
A  0.907969  2.706850
C  0.528813 -2.018168
E  2.605967  0.190794